  let questions = [
    {
    numb: 1,
    question: "دورة التنفيز تقوم بتنفيز التعليمه بوسطة وحدة التحكم",
    answer: "خطأ",
    options: [
      "صح",
      "خطأ",
      "",
      ""
    ]
  },
  {    numb: 2,
    question: "تقوم بتخزين ناتج العملية الحسابيه وارسالها الي الزاكرة الرئيسيه",
    answer: "دورة التنفيز",
    options: [
      "وحدة الحساب والمنطق",
      "دورة التعليمة",
      "دورة التنفيز",
      "جميع ما سبق"
    ]
  },
    {
    numb: 3,
    question: "اول معالج تم تصنيعه للاغراض العامه هو",
    answer: "لا توجد اجابه صحيحه",
    options: [
      "8008 year 1974",
      "8086 year 1978",
      "8080 year 1978",
      "لا توجد اجابه صحيحه"
    ]
  },
    {
    numb: 4,
    question: "مسارات النظام المسار فيها يتكون من عدة اسلاك تسير معا علي التوالي في لوحة النظام وكل سلك يحمل واحد بت في نفس الوقت ",
    answer: "خطا",
    options: [
      "صح",
      "خطا",
      "",
      ""
    ]
  },
    {
    numb: 5,
    question: "يتعامل الحاسب مع البيانات رقميه فقط",
    answer: "صح",
    options: [
      "صح",
      "خطا",
      "",
      ""
    ]
  },

    {
  numb: 6,
  question: "يقوم الحاسب بمعالجة البيانات ويحولها الي المعلومات",
  answer: "صح",
    options: [
      "صح",
      "خطأ",
      "",
      ""
    ]
  },
];
