  let questions = [
    {
    numb: 1,
    question: "يعمل جهاز الحاسب علي تحويل المعلومات الي البيانات؟",
    answer: "خطاء",
    options: [
      "صح",
      "خطاء",
      "",
      ""
    ]
  },
    {
    numb: 2,
    question: "يتكون نظام الحاسب من مكونات مادية ومعنوية ومعلومات ومستخدمون؟",
    answer: "صح",
    options: [
      "صح",
      "خطاء",
      "",
      ""
    ]
  },
    {
    numb: 3,
    question: "هو معدة الكترونية يتحكم في عملة برامج مخزنة في ذاكرتة الخاصة؟",
    answer: "جهاز الحاسب",
    options: [
      "نظام الحاسب",
      "جهاز الحاسب",
      "اوب معنا",
      "لا توجد اجابة صحيحة"
    ]
  },
    {
    numb: 4,
    question: "بدا استخدام الحاسب الالي بشكل تجاري في عام",
    answer: "1951",
    options: [
      "1915",
      "1946",
      "1964",
      "1951"
    ]
  },
    {
    numb: 5,
    question: "من خصائص الجيل الاول من الحاسبات؟",
    answer: "البرمجة بلغة الالة",
    options: [
      "البرمجة بلغة التجميع",
      "البرمجة بلغة الالة",
      "يعتمد في تصنيعة علي الترانزستور",
      "يعتمد في تصنية علي (Ic)"
    ]
  },

    {
  numb: 6,
  question: "برامج النظام هي التي يستخدمها المستخدمون لانجاز المهام؟",
  answer: "خطاء",
    options: [
      "صح",
      "خطاء",
      "",
      ""
    ]
  },


    {
  numb: 6,
  question: "من اهم ملامح الجيل الخامس ظهور الحاسبات الشخصية",
  answer: "خطاء",
    options: [
      "صح",
      "خطاء",
      "",
      ""
    ]
  },
];