let questions = [
  {
  numb: 1,
  question: "الذاكرة المباشرة للمعالج",
  answer: "كاش cache",
  options: [
    "كاش cache",
    "المسجلات registers",
    "الرام ram",
    "التخزين الثانوي"
  ]
},
{    numb: 2,
  question: "يمكن تصنيف برامج اكتشاف الفيروسات,  من",
  answer: "برامج المنافع",
  options: [
    "برامج المنافع",
    "برامج التحكم في الاجهزة",
    "برامج تشغيل الاجهزة الملحقة",
    "جميع ما سبق"
  ]
},
  {
  numb: 3,
  question: "يمكن تصنيف برامج  مدير الملفات File Explorer,  من ..  ",
  answer: "برامج المنافع",
  options: [
    "برامج التحكم في الأجهزة",
    "برامج المنافع",
    "جميع الخيارات صحيحة",
    "برامج تشغيل الأجهزة الملحقة"
  ]
},
  {
  numb: 4,
  question: "يمكن تصنيف برامج  الغاء التجزية القرص Disk Defragmenter,  من ..  ",
  answer: "برامح المساعدة او المنافع",
  options: [
    "برامح المساعدة او المناف",
    "برامج المنافع فقط",
    "برامج التطبيقات",
    "برامج التحكم في الأجهزة",
    "برامج المساعدة فقط"
  ]
},
  {
  numb: 5,
  question: "  يقوم  .......بالتحكم في مكونات الحاسب واجراء العمليات المطلوبة للبيانات   ",
  answer: "المعالج",
  options: [
    "المعالج",
    "الذاكرة الثانوية",
    "الذاكرة الرئيسية",
    "الرام ram"
  ]
},

  {
numb: 6,
question: "يعتبر برنامج عرض محتويات الفلاش ميموري , من ",
answer: "برامج المعدات (تعريفات)Drivers",
  options: [
    "برامج المعدات (تعريفات)Drivers",
    "جميع الخيارات متاحة",
    "برامج المساعدة او المنافع",
    "برامج نظم التشغيل"
  ]
},
{
  numb: 7,
  question: "يمكن تصنيف برامج التعريفات , من   ",
  answer: "برامج تشغيل الأجهزة الملحقة",
    options: [
      "برامج المعدات (تعريفات)Drivers",
      "برامج تشغيل الأجهزة الملحقة",
      "برامج التحكم في الاجهزة",
      "برامج المنافع او المساعدة"
    ]
  },
  {
    numb: 8,
    question: "يقوم الكمبيوتر ببدء التشغيل بعد انقطاع التيار الكهربائي , من خلال البرامج المخزنة علي , نستخدم ذاكرة ...    ",
    answer: "الروم rom",
      options: [
        "الروم rom",
        "التخزين الثانوي",
        "برامج المساعدة او المنافع",
        "المسجلات registers"
      ]
    },
];